;;---------------------------------------------------------------------------
;;---------------------------------------------------------------------------
;;
;; emacs init.el
;;
;;---------------------------------------------------------------------------
;;---------------------------------------------------------------------------

;; ---------------------------------------------------------------------------
;; local elisp files
;; ---------------------------------------------------------------------------

;; 設定ファイルのディレクトリ
(add-to-list 'load-path "~/.emacs.d/dconf")

;; 雑多な設定
(require 'bizz-conf)

;; エディタの外観/サイズ調整
(require 'appearance-conf)

;; 外部パッケージ(要package-install)
(require 'package-conf)

;; 言語設定(要package-install)
(require 'language-conf)

;; 外部のpackage化されてない追加機能(package-install不要)
(require 'external-elisp)

;; 自作の追加機能(package-install不要)
(require 'internal-elisp)

;; キーバインド設定(package-install不要)
(require 'key-binding)

;;---------------------------------------------------------------------------
;; temp
;;---------------------------------------------------------------------------
