;;---------------------------------------------------------------------------
;;---------------------------------------------------------------------------
;;
;; Emacs非標準機能(package-install要) / nonstandard-conf.el
;;
;;---------------------------------------------------------------------------
;;---------------------------------------------------------------------------

;; ---------------------------------------------------------------------------
;; 普通のredo
;;---------------------------------------------------------------------------
(use-package redo+
  :config
  (setq undo-no-redo t)
  (setq undo-limit 60000)
  (setq undo-strong-limit 90000))

;;---------------------------------------------------------------------------
;; visual regexp steroids : 正規表現の拡張
;;---------------------------------------------------------------------------
(use-package visual-regexp-steroids
  :config
  (setq vr/engine 'java))

;;---------------------------------------------------------------------------
;; mouse disable : マウス禁止
;;---------------------------------------------------------------------------
(use-package disable-mouse
  :config
  (global-disable-mouse-mode))

;;---------------------------------------------------------------------------
;; smooth scroll : スクロール滑川
;;---------------------------------------------------------------------------
(use-package smooth-scroll
  :config
  (setq mouse-wheel-scroll-amount '(1 ((shift) . 1)))
  (smooth-scroll-mode t))

;;---------------------------------------------------------------------------
;; auto complete : 自動補完
;;---------------------------------------------------------------------------
(use-package auto-complete
  :config
  (ac-config-default)
  (add-to-list 'ac-dictionary-directories "~/.emacs.d/ac-dict"))

;;---------------------------------------------------------------------------
;; ace jump mode : 任意の場所に3ストロークで移動
;;---------------------------------------------------------------------------
(use-package ace-jump-mode)

;;---------------------------------------------------------------------------
;; anzu : モードラインの右側に検索中の単語数を表示
;;---------------------------------------------------------------------------
(use-package anzu
  :config
  (global-anzu-mode t))

;;---------------------------------------------------------------------------
;; auto highlight symbol : カーソル位置のシンボルの自動ハイライト
;;---------------------------------------------------------------------------
(use-package auto-highlight-symbol
  :config
  (global-auto-highlight-symbol-mode t))

;;---------------------------------------------------------------------------
;; auto highlight symbol : カーソル位置のシンボルの自動ハイライト
;;---------------------------------------------------------------------------
(use-package auto-highlight-symbol
  :config
  (global-auto-highlight-symbol-mode t))

;;---------------------------------------------------------------------------
;; google this : ググる
;;---------------------------------------------------------------------------
;; key-bind : google-this

(use-package google-this
  :config
  (google-this-mode t)
  (setq google-this-location-suffix "co.jp")
  (global-auto-highlight-symbol-mode t)
  (defun google-this-url ()
    "URL for google searches."
    (concat google-this-base-url google-this-location-suffix
	    "/search?q=%s&hl=ja&num=100&as_qdr=y5&lr=lang_ja")))

;;---------------------------------------------------------------------------
;; auto highlight symbol : カーソル位置のシンボルの自動ハイライト
;;---------------------------------------------------------------------------
(use-package auto-highlight-symbol
  :config
  (global-auto-highlight-symbol-mode t))

;;---------------------------------------------------------------------------
;; provide
;;---------------------------------------------------------------------------
(provide 'nonstandard-conf)
