;;; jump-packages.el --- packages
;;; Commentary:
;;;  Emacsインストールパッケージ(package-install要) / jump-packages.el
;;;  package jump : 移動
;;; Code:
(require 'package)
(require 'use-package)
(require 'util-elisp)

;;; ---------------------------------------------------------------------------
;;; bm : 現在行を永続的に記憶
;;; ---------------------------------------------------------------------------
(use-package-with-report bm)

;;; ---------------------------------------------------------------------------
;;; dumb-jump : 言語によらず定義にジャンプ
;;; ---------------------------------------------------------------------------
(use-package-with-report dumb-jump
  :config
  (setq dumb-jump-mode t))

;;; ---------------------------------------------------------------------------
;;; package-move : ace window : smartなwindow移動
;;; ---------------------------------------------------------------------------
(use-package-with-report ace-window)

;;; ---------------------------------------------------------------------------
;;; ace jump mode : 任意の場所に3ストロークで移動
;;; ---------------------------------------------------------------------------
(use-package-with-report ace-jump-mode
  :config
  (setq aw-minibuffer-flag t))

;;; ---------------------------------------------------------------------------
;;; subword mode : Camel notationのシンボル移動時の単位を変更
;;; ---------------------------------------------------------------------------
;;; (before) |ITransientAssociative| -> (after) |I|Transient|Associative|
(use-package-with-report subword
  :config
 (global-subword-mode +1))

;;; ---------------------------------------------------------------------------
;;; package-move : goto chg : 最後に変更した箇所へカーソルを移動
;;; ---------------------------------------------------------------------------
(use-package-with-report goto-chg)

;;; --------------------------------------------------------------------------------
;;; provide
;;; --------------------------------------------------------------------------------
(provide 'jump-packages)
;;; jump-packages.el ends here
